[
{
"title": "E La Carte",
"img": "imgs/elacarte.jpg",
"text": "This electronic menu system is designed to improve ordering in traditional individual-order restaurants. However, it is not currently applied to group-order restaurants. Other systems such as this are used in restaurants such as Boloco to specify actually what each dish should contain. ~ James"
},

{
"title": "Traditional Family Style Restaurants",
"img": "imgs/familyrestaurant.jpg",
"text": "Interactions in current family style restaurants provide the framework for how interactions should work for our system. People don’t want to abandon the “traditional ways” easily. ~ James"
},

{
"title": "Scales",
"img": "imgs/scales.jpg",
"text": "A balanced diet is a concern of many people who go to a restaurant, or balancing the distribution of food so that everyone has something they are capable of eating. While not physical, it is an important part of group ordering. ~ Kai"
},

{
"title": "Google Drive",
"img": "imgs/drive.png",
"text": "Collaborating with others with Google Drive is extremely easy. You can see who is who, who is making what changes, and where the group stands on completing the overall goal at any given time. In the same way, our system should easily allow patrons to collaborate together to determine what is the appropriate meal for the group as a whole. ~ James"
},

{
"title": "D&D Dungeon Master:",
"img": "imgs/dd.jpg",
"text": "In D&D, one player, called the Dungeon Master, controls the flow of the game and the story. He makes all of the final decisions on how the game is played. Almost always, he is more knowledgeable on the game than the other players, and he uses his experience to determine which direction the game should take so that the players receive the most enjoyment. DMs are proud of their ability to control games with skill and finesse. Similarly, when group ordering, one member of the group steps up to be the “leader” of the table. They determine what foods the table should get based off of the various restrictions the party has, such as allergies or religious restrictions. His experience gives him the ability to suggest meals, identify “staple” meals of the restaurant, veto bad choices, and overall balance the meal appropriately so that everyone is satisfied. The leader takes pride in his ability to craft a meal that suits everyone’s taste. In D&D, the DM is given very specific abilities to control the flow of the game. We’d like to incorporate this clear segregation of power in much the same way so that it is clear what control each person has over the menu. At the same time, we’d like to create an easier way for the leader to share his knowledge with the group, much like how the DM imparts his knowledge onto the players. Incorporating these aspects into our design will maintain the leader’s pride and control over the meal while encouraging him to share his knowledge with others. - Zach"
},

{
"title": "Prezi",
"img": "imgs/prezi.jpg",
"text": "Prezi, a zoom-based (rather than slide based) presentation program, inspired the following idea: a large amount of information can be displayed on one page at various scales, the text/image size corresponding to how detailed vs top-level the information is. The user can choose areas of the page to zoom in on if they wish to find out more. We would like our restaurant interface to allow the user to learn more about specific dishes (ingredients, preparation, cultural origin, eating conventions). A zoom-based interface allows us to put much detailed information about a dish right where it is on the menu without disrupting the flow of the traditional printed menu look. ~ James"
},

{
"title": "Yelp",
"img": "imgs/yelp.png",
"text": "The filtering functionality is accessible with one touch, and the options toggle with one touch. Response time is reasonable given the amount of data processing going on behind the scenes. This one-touch, fast feedback design is catered towards those using Yelp on-the-go. Our design can improve on the intuitiveness of the actual interface, but borrow elements which minimize the amount of time spent ordering. ~ James"
},

{
"title": "Sushi Boat",
"img": "imgs/sushi.jpg",
"text": "The sushi boat is both aesthetically pleasing and helps facilitate individual choice from a group order, according to one of our interviewers."
},

{
"title": "Bell",
"img": "imgs/bell.jpg",
"text": "The traditional ordering bell immediately invokes the mindset that the waiter is only one bell press away in the patron’s mind."
},

{
"title": "Waiter/Waitress",
"img": "imgs/waiter.jpg",
"text": "Waiters serve to provide extra information or answer menu/order related questions, especially when it comes to popularity or special cases like lesser known allergies. Our goal is not to replace waiters, but the types of questions they are often asked is something to consider. ~ Kai"
},

{
"title": "Pinterest",
"img": "imgs/pinterest.jpg",
"text": "To quote the site summary, %x22Pinterest is a tool for collecting and organizing the things you love.%x22 This site hosts a number of food related images (among other things), which people can collect, organize, share, etc. The interface is really straightforward and easy to use, as should our menu be. Restaurants handle a diversity of people. Friends are likely in same age range. Families however can have less technologically adept members, like children and the elderly. Several of the people we interviewed said that if images were present in menus, they would be more likely to order them. This is especially true if they have never been to a place before. To quote, “A picture speaks a thousand words.” It can also assist with language barriers in the case of foreigners. The minimal text merely serves as a caption for the picture which generally includes what the food image is made of. In general browsing, all images are grouped together based on category and type, which is similar to the menu %x22sections%x22. However, the user may also “pin it” into their own category or folder. This is similar to offering suggestions for the person ordering who must then decide from the pool of suggestions what the final order would be. Pinterest also has a “like button” (very subtle), which notes how popular the image is. Quite similarly, with menus, people might default to ordering what is most popular. Generally they would either inquire the waiter or a member of their party more familiar with the restaurant what this would be. ~ Kai"
},

{
"title": "Wooden Menus",
"img": "imgs/wooden.jpg",
"text": "Wooden menus invoke a feeling of homeliness and comfort that makes restaurants seem down-to-earth, appealing, and inviting."
},

{
"title": "Github",
"img": "imgs/github.png",
"text": "Using Github’s statistics, you can track who contributes to coding projects over time. Similarly, patrons might want to track who eats what over time so that the bill is more evenly split among who eats what."
},

{
"title": "Looking for Group",
"img": "imgs/wow.png",
"text": "In World of Warcraft, building a balanced party is so important that the game almost requires each party to have one tank, one healer, and three damage dealers. In the same vein, a group meal should be balanced appropriately, but in a way that feels natural and unforced. Group Balancing: In Fire Emblem, you have to construct a balanced team to survive an onslaught of enemies. Each party member has a set of skills, weapons, and items they can use. Similarly, picking food must be balanced, and each dish must have certain ingredients. Having an easy interface where you can easily see this info and turn on/off meals would be valuable."
},

{
"title": "Nutrition Facts &mp; Ingredient information",
"img": "imgs/nutrition.jpg",
"text": "The panel that appears on just about everything sold in stores. For some, knowing what is in your food is one of the most important parts of ordering a meal. Pictures have their limitations, and traditional menus do not note allergy information. ~ Kai"
},

{
"title": "Complexity Cube",
"img": "imgs/complexity.jpg",
"text": "This is a decision making device designed to simplify complex organization when there are many different factors to consider. Each factor that must be taken into account, for example price and preferences, hold a dimension in the cube. By eliminating the associated row/column/other, you can substantially narrow down the menu’s available options. In terms of ordering food, there would be less options to choose from and allows ordering to be faster. ~ Kai"
},

{
"title": "Portable Credit Card Readers",
"img": "imgs/credit.jpg",
"text": "These devices are the easiest way for people to pay using their credit card without having to worry about giving numerous credit cards to the waiter."
},

{
"title": "Tip Calculator",
"img": "imgs/tip.png",
"text": "When it comes to billing, figuring out how to split the check is difficult. But then there is the tip to somehow consider. The tip calculator (found on internet and smart phones, but not that well known) does the very simple task of splitting the tip evenly among the party. ~ Kai"
}
]